flowchart TD

    %% شروع فرآیند
    
    A([Start]) --> B[دانشجو وارد سامانه می‌شود]
    B --> C[دانشجو فرم اطلاعات کارآموزی را تکمیل می‌کند]
    C --> D[دانشجو درخواست را ارسال می‌کند]
    D --> E[درخواست به استاد راهنما ارسال می‌شود]
    E --> F{آیا استاد درخواست را تأیید می‌کند؟}
    
    F -->|بله| G[مدیر آموزش درخواست را بررسی می‌کند]
    F -->|خیر| H[درخواست رد می‌شود]
    
    G --> I{آیا مدیر آموزش درخواست را تأیید می‌کند؟}
    I -->|بله| J[درخواست نهایی تأیید و ثبت می‌شود]
    I -->|خیر| H
    
    H --> K[دانشجو از نتیجه (رد یا قبول) مطلع می‌شود]
    J --> K
    K --> L([End])
